# frozen_string_literal: true

FLAT_NAME = [
  'Комната в трешке',
  'Двушка на войковской',
  'Арт-пространство',
  'Комната для дизайнера'
].freeze

SEX = %w[
  м
  ж
  другой
].freeze

SURNAME = %w[
  Ли
  Кондратенко
  Марченко
  Солнце
  Школьник
  Бейкон
  Шулер
  Диденко
  Константинополько
  Штейн
  Гинсбург
  Петербург
  Шарий
  Спивак
  Шухевич
  Ткач
  Беньо
  Сампел
]

FLAT_DESCRIPTION = [
  'Нормальная студия, панорамные окна, я работаю программистом и ищу человека, который рано ложится и любит пить матчу, я ее заказываю вагонами, было бы круто разделить счет. Играю в дженгу и прочие настолки, не против шумных вечеров несколько раз в месяц.',
  'Мы 2 тихих девушки, любим пост-рок, учимся в медицинском, было бы здорово, если бы нам было, о чем поговорить. Есть лысый котик, но он тоже интроверт.',
  'Мы трое архитекторов, интроверты — велкам!',
  'Тусим с утра и до ночи и ищем такого же отбитого человека, ночью часто играет громкая музыка, любим звать к себе домой друзей-патимейкеров, ну и вообще дома устраиваем тучи почище мутабора, у меня есть 2 колонки, бас качают — закачаешься, короче вы не должны быть против.',
  'Дома всегда дружелюбная атмосфера и я хочу ее сохранить. Очень трепетно отношусь к личному пространству, берегу чужие границы. ',
  'Метро ВДНХ 10-12 минут, раcстояние - 1км если ходит по прямой, как ходят все люди микрорайона, 1,3 км это если по автодорогам. В квартире чисто и очень уютная. Южная сторона - светло и красиво. В комнате есть комод, двуспальный большой диван, письменный стол, большой шкаф для вещей в коридоре. Район тихий и безопасный, три пятёрочки магнит, фикспрайс и билла в трёх минутах. Во дворе бесплатная парковка без шлагбаумов, парковка есть всегда, т.к. рядом идут односторонние улицы. всегда близко каршеринг Яндекса 3-6 минут. Состояние такое же как на фото, только кухня еще уютнее, со шторой и креслом. Соседи мы, молодые супруги, порядочная и творческая пара, фотографы из Fashion индустрии.',
]

PERSONAL_INFO = [
  'Работаю дизайнером в своей веб-студии, дома бываю нечасто, в основном чтобы переночевать. Гостей парней и прочую живность не вожу. Живу с лысым котом, к лотку приучен, из комнаты не выходит.',
  'Учусь в медицинском, пишу диплом, дома провожу все время. Слушаю пост-рок, играю в дженгу и иногда хожу на концерты maybeshewill. ',
  'Жду окончания изоляции, чтобы снова кататься на скейте, ходить на концерты и пить капучино в парке Горького. Когда каникул больше нет, лето наступает в душе',
  'Программирую, катаю на скейте в свободное время. Умею кататься боков, верхом и еще много как. Люблю готовить, поэтому если ты будешь покупать продукты, я могу взять всю готовку на себя. Фотографирую на беззеркаалку SONY6000, есть много объективов, так что можно шарить парк объективов.',
  'Угораю по путешествиям, почти не бываю дома, но когда бываю, то там становится очень шумно. Слушаю Crystal Castles и не могу жить без курения в квартире.',
  'Играю в своей панк-группе и пеориодически устраиваю репетиции дома. Да и не только репетиции, утаить тоже люблю. Не против совместных пати, спокойно отношусь к громкой музыке до утра.',
]
